quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'tr', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Что такое функция?',
        'options': ['Блок кода', 'Переменная', 'Цикл', 'Условие'],
        'correct_option': 0
    },
    {
        'question': 'Что такое цикл?',
        'options': ['Блок кода', 'Переменная', 'Цикл', 'Условие'],
        'correct_option': 2
    },
    {
        'question': 'Что такое условие?',
        'options': ['Блок кода', 'Переменная', 'Цикл', 'Условие'],
        'correct_option': 3
    },
    {
        'question': 'Что такое переменная?',
        'options': ['Блок кода', 'Переменная', 'Цикл', 'Условие'],
        'correct_option': 1
    },
    {
        'question': 'Что такое массив?',
        'options': ['Блок кода', 'Переменная', 'Массив', 'Условие'],
        'correct_option': 2
    },
    {
        'question': 'Что такое словарь?',
        'options': ['Блок кода', 'Переменная', 'Массив', 'Словарь'],
        'correct_option': 3
    },
    {
        'question': 'Что такое кортеж?',
        'options': ['Блок кода', 'Переменная', 'Массив', 'Кортеж'],
        'correct_option': 3
    },
    {
        'question': 'Что такое класс?',
        'options': ['Блок кода', 'Переменная', 'Массив', 'Класс'],
        'correct_option': 3
    }
]